In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
df = pd.read_csv('BMW_carprices.csv')
df

    Mileage  Age(yrs)  Sell Price($)
0     69000         6          18000
1     35000         3          34000
2     57000         5          26100
3     22500         2          40000
4     46000         4          31500
5     59000         5          26750
6     52000         5          32000
7     72000         6          19300
8     91000         8          12000
9     67000         6          22000
10    83000         7          18700
11    79000         7          19500
12    59000         5          26000
13    58780         4          27500
14    82450         7          19400
15    25400         3          35000
16    28000         2          35500
17    69000         5          19700
18    87600         8          12800
19    52000         5          28200

In [5]:
X = df[['Mileage', 'Age(yrs)']]
y = df['Sell Price($)']

In [7]:
from sklearn.model_selection import train_test_split
X_train,X_test, y_train,y_test = train_test_split(X,y,test_size = 0.2, random_state = 10)
# 20% data will be choosen as test data, random_state is similar to random seed, used to fix the random choosen data

In [8]:
X_train

    Mileage  Age(yrs)
3     22500         2
18    87600         8
13    58780         4
2     57000         5
14    82450         7
8     91000         8
17    69000         5
16    28000         2
19    52000         5
12    59000         5
11    79000         7
1     35000         3
0     69000         6
15    25400         3
4     46000         4
9     67000         6

In [9]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [11]:
model.fit(X_train,y_train)

LinearRegression()

In [12]:
model.predict(X_test)

array([20474.0745775 , 16352.07892168, 25174.14834912, 27197.42175439])

In [13]:
y_test

7     19300
10    18700
5     26750
6     32000
Name: Sell Price($), dtype: int64

In [14]:
model.score(X_test,y_test)

0.7332339593090137